mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/sdcard.c
    if (drv) return STA_NOINIT;            /* Supports only single drive */
    sd_power_on();                            /* Force socket power on */
    if (!sdcard_is_present()) return Stat;    /* No card in the socket */
    
    sd_sel_spi_mode();            /* Ensure the card is in SPI mode */

    sd_assert_cs();                /* CS = L */
    ty = 0;
    if (sd_spi_send_cmd(CMD0, 0) == 1) {            /* Enter Idle state */
    // sd_deassert_cs();
    // sd_wait_ready();
    // sd_assert_cs();
        if (sd_spi_send_cmd(CMD8, 0x1AA) == 1) {    /* SDC Ver2+ */
            for (n = 0; n < 4; n++) ocr[n] = sd_spi_recieve_byte();
            if (ocr[2] == 0x01 && ocr[3] == 0xAA) {    /* The card can work at vdd range of 2.7-3.6V */
                start = mp_hal_ticks_ms();                      /* Initialization timeout of 1000 msec */
                do {
                    sd_wait_ready(); // Prevent command banging
                    if ((sd_spi_send_cmd(CMD55, 0) <= 1) && (sd_spi_send_cmd(CMD41, 0x40000000) == 0)) {
                        break;
                    }     /* ACMD41 with HCS bit */
                } while ((mp_hal_ticks_ms() - start) < 1000);
                if ((mp_hal_ticks_ms() - start) < 1000 && sd_spi_send_cmd(CMD58, 0) == 0) {    /* Check CCS bit */
                    for (n = 0; n < 4; n++) ocr[n] = sd_spi_recieve_byte();
                    ty = (ocr[0] & 0x40) ? 6 : 2;
                }
            }
        } else {                            /* SDC Ver1 or MMC */
            ty = (sd_spi_send_cmd(CMD55, 0) <= 1 && sd_spi_send_cmd(CMD41, 0) <= 1) ? 2 : 1;    /* SDC : MMC */
            start = mp_hal_ticks_ms();                      /* Initialization timeout of 1000 msec */
            do {
                if (ty == 2) {
                    if (sd_spi_send_cmd(CMD55, 0) <= 1 && sd_spi_send_cmd(CMD41, 0) == 0) break;    /* ACMD41 */
                } else {
                    if (sd_spi_send_cmd(CMD1, 0) == 0) break;                                /* CMD1 */
                }
            } while ((mp_hal_ticks_ms() - start) < 1000);
            if (!((mp_hal_ticks_ms() - start) < 1000) || sd_spi_send_cmd(CMD16, 512) != 0)    /* sd_assert_cs R/W block length */
                ty = 0;
        }
    }
    CardType = ty;
    sd_deassert_cs();            /* CS = H */
    sd_spi_recieve_byte();            /* Idle (Release DO) */

    if (ty) {            /* Initialization succeded */
        Stat &= ~STA_NOINIT;        /* Clear STA_NOINIT */
        sd_spi_set_max_speed();
    } else {            /* Initialization failed */
        sd_power_off();
    }

    return Stat;
}



/*-----------------------------------------------------------------------*/
/* Get Disk Status                                                       */
/*-----------------------------------------------------------------------*/
DSTATUS sd_disk_staus (
    uint8_t drv        /* Physical drive nmuber (0) */
) {
    if (drv) return STA_NOINIT;        /* Supports only single drive */
    return Stat;
}



/*-----------------------------------------------------------------------*/
/* Read Sector(s)                                                        */
/*-----------------------------------------------------------------------*/
DRESULT sd_disk_read (
    uint8_t drv,            /* Physical drive nmuber (0) */
    uint8_t *buff,            /* Pointer to the data buffer to store read data */
    uint32_t sector,        /* Start sector number (LBA) */
    uint8_t count            /* Sector count (1..255) */
) {
    if (drv || !count) return RES_PARERR;
    if (Stat & STA_NOINIT) return RES_NOTRDY;

    if (!(CardType & 4)) sector *= 512;    /* Convert to byte address if needed */

    sd_assert_cs();            /* CS = L */

    if (count == 1) {    /* Single block read */
        if ((sd_spi_send_cmd(CMD17, sector) == 0)    /* READ_SINGLE_BLOCK */
            && sd_spi_receive_block(buff, 512))
            count = 0;
    }
    else {                /* Multiple block read */
        if (sd_spi_send_cmd(CMD18, sector) == 0) {    /* READ_MULTIPLE_BLOCK */
            do {
                if (!sd_spi_receive_block(buff, 512)) break;
                buff += 512;
            } while (--count);
            sd_spi_send_cmd12();                /* STOP_TRANSMISSION */
        }
    }

    sd_deassert_cs();            /* CS = H */
    sd_spi_recieve_byte();            /* Idle (Release DO) */

    return count ? RES_ERROR : RES_OK;
}

DRESULT sd_disk_read_dma (
    uint8_t drv,            /* Physical drive nmuber (0) */
    uint8_t *buff,            /* Pointer to the data buffer to store read data */
    uint32_t sector,        /* Start sector number (LBA) */
    uint8_t count            /* Sector count (1..255) */
) {
    if (drv || !count) return RES_PARERR;
    if (Stat & STA_NOINIT) return RES_NOTRDY;

    if (!(CardType & 4)) sector *= 512;    /* Convert to byte address if needed */

    sd_assert_cs();            /* CS = L */

    if (count == 1) {    /* Single block read */
        if ((sd_spi_send_cmd(CMD17, sector) == 0)    /* READ_SINGLE_BLOCK */
            && sd_spi_receive_block(buff, 512))
            count = 0;
    }
    else {                /* Multiple block read */
        if (sd_spi_send_cmd(CMD18, sector) == 0) {    /* READ_MULTIPLE_BLOCK */
            do {
                if (!sd_spi_receive_block(buff, 512)) break;
                buff += 512;
            } while (--count);
            sd_spi_send_cmd12();                /* STOP_TRANSMISSION */
        }
    }

    sd_deassert_cs();            /* CS = H */
    sd_spi_recieve_byte();            /* Idle (Release DO) */

    return count ? RES_ERROR : RES_OK;
}



/*-----------------------------------------------------------------------*/
/* Write Sector(s)                                                       */
/*-----------------------------------------------------------------------*/
#if _READONLY == 0
DRESULT sd_disk_write (
    uint8_t drv,            /* Physical drive nmuber (0) */
    const uint8_t *buff,    /* Pointer to the data to be written */
    uint32_t sector,        /* Start sector number (LBA) */
    uint8_t count            /* Sector count (1..255) */
) {
    if (drv || !count) return RES_PARERR;
    if (Stat & STA_NOINIT) return RES_NOTRDY;
    if (Stat & STA_PROTECT) return RES_WRPRT;

    if (!(CardType & 4)) sector *= 512;    /* Convert to byte address if needed */

    sd_assert_cs();            /* CS = L */

    if (count == 1) {    /* Single block write */
        if ((sd_spi_send_cmd(CMD24, sector) == 0)    /* WRITE_BLOCK */
            && sd_spi_transmit_block(buff, 0xFE))
            count = 0;
    }
    else {                /* Multiple block write */
        if (CardType & 2) {
            sd_spi_send_cmd(CMD55, 0); sd_spi_send_cmd(CMD23, count);    /* ACMD23 */
        }
        if (sd_spi_send_cmd(CMD25, sector) == 0) {    /* WRITE_MULTIPLE_BLOCK */
            do {
                if (!sd_spi_transmit_block(buff, 0xFC)) break;
                buff += 512;
            } while (--count);
            if (!sd_spi_transmit_block(0, 0xFD))    /* STOP_TRAN token */
                count = 1;
        }
    }

    sd_deassert_cs();            /* CS = H */
    sd_spi_recieve_byte();            /* Idle (Release DO) */

    return count ? RES_ERROR : RES_OK;
}

DRESULT sd_disk_write_dma (
    uint8_t drv,            /* Physical drive nmuber (0) */
    const uint8_t *buff,    /* Pointer to the data to be written */
    uint32_t sector,        /* Start sector number (LBA) */
    uint8_t count            /* Sector count (1..255) */
) {
    if (drv || !count) return RES_PARERR;
    if (Stat & STA_NOINIT) return RES_NOTRDY;
    if (Stat & STA_PROTECT) return RES_WRPRT;

    if (!(CardType & 4)) sector *= 512;    /* Convert to byte address if needed */

    sd_assert_cs();            /* CS = L */

    if (count == 1) {    /* Single block write */
        if ((sd_spi_send_cmd(CMD24, sector) == 0)    /* WRITE_BLOCK */
            && sd_spi_transmit_block(buff, 0xFE))
            count = 0;
    }
    else {                /* Multiple block write */
        if (CardType & 2) {
            sd_spi_send_cmd(CMD55, 0); sd_spi_send_cmd(CMD23, count);    /* ACMD23 */
        }
        if (sd_spi_send_cmd(CMD25, sector) == 0) {    /* WRITE_MULTIPLE_BLOCK */
            do {
                if (!sd_spi_transmit_block(buff, 0xFC)) break;
                buff += 512;
            } while (--count);
            if (!sd_spi_transmit_block(0, 0xFD))    /* STOP_TRAN token */
                count = 1;
        }
    }

    sd_deassert_cs();            /* CS = H */
    sd_spi_recieve_byte();            /* Idle (Release DO) */

    return count ? RES_ERROR : RES_OK;
}
#endif /* _READONLY */



/*-----------------------------------------------------------------------*/
/* Miscellaneous Functions                                               */
/*-----------------------------------------------------------------------*/

DRESULT sd_disk_ioctl (
    uint8_t drv,        /* Physical drive nmuber (0) */
    uint8_t ctrl,        /* Control code */
    void *buff        /* Buffer to send/receive control data */
) {
    DRESULT res;
    uint8_t n, csd[16], *ptr = buff;
    uint16_t csize;


    if (drv) return RES_PARERR;

    res = RES_ERROR;

    if (ctrl == CTRL_POWER) {
        switch (*ptr) {
        case 0:        /* Sub control code == 0 (sd_power_off) */
            if (sd_chk_power())
                sd_power_off();        /* Power off */
            res = RES_OK;
            break;
        case 1:        /* Sub control code == 1 (sd_power_on) */
            sd_power_on();                /* Power on */
            res = RES_OK;
            break;
        case 2:        /* Sub control code == 2 (POWER_GET) */
            *(ptr+1) = (uint8_t)sd_chk_power();
            res = RES_OK;
            break;
        default :
            res = RES_PARERR;
        }
    }
    else {
        if (Stat & STA_NOINIT) return RES_NOTRDY;

        sd_assert_cs();        /* CS = L */

        switch (ctrl) {
        case GET_SECTOR_COUNT :    /* Get number of sectors on the disk (uint32_t) */
            if ((sd_spi_send_cmd(CMD9, 0) == 0) && sd_spi_receive_block(csd, 16)) {
                if ((csd[0] >> 6) == 1) {    /* SDC ver 2.00 */
                    csize = csd[9] + ((uint16_t)csd[8] << 8) + 1;
                    *(uint32_t*)buff = (uint32_t)csize << 10;
                } else {                    /* MMC or SDC ver 1.XX */
                    n = (csd[5] & 15) + ((csd[10] & 128) >> 7) + ((csd[9] & 3) << 1) + 2;
                    csize = (csd[8] >> 6) + ((uint16_t)csd[7] << 2) + ((uint16_t)(csd[6] & 3) << 10) + 1;
                    *(uint32_t*)buff = (uint32_t)csize << (n - 9);
                }
                res = RES_OK;
            }
            break;

        case GET_SECTOR_SIZE :    /* Get sectors on the disk (uint16_t) */
            *(uint16_t*)buff = 512;
            res = RES_OK;
            break;

