mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/sdcard.c
        case CTRL_SYNC :    /* Make sure that data has been written */
            if (sd_wait_ready() == 0xFF)
                res = RES_OK;
            break;

        case MMC_GET_CSD :    /* Receive CSD as a data block (16 bytes) */
            if (sd_spi_send_cmd(CMD9, 0) == 0        /* READ_CSD */
                && sd_spi_receive_block(ptr, 16))
                res = RES_OK;
            break;

        case MMC_GET_CID :    /* Receive CID as a data block (16 bytes) */
            if (sd_spi_send_cmd(CMD10, 0) == 0        /* READ_CID */
                && sd_spi_receive_block(ptr, 16))
                res = RES_OK;
            break;

        case MMC_GET_OCR :    /* Receive OCR as an R3 resp (4 bytes) */
            if (sd_spi_send_cmd(CMD58, 0) == 0) {    /* READ_OCR */
                for (n = 0; n < 4; n++)
                    *ptr++ = sd_spi_recieve_byte();
                res = RES_OK;
            }

//        case MMC_GET_TYPE :    /* Get card type flags (1 byte) */
//            *ptr = CardType;
//            res = RES_OK;
//            break;

        default:
            res = RES_PARERR;
        }

        sd_deassert_cs();            /* CS = H */
        sd_spi_recieve_byte();            /* Idle (Release DO) */
    }

    return res;
}

void sdcard_init(void) {
    sd_power_on();
    // sd_disk_init(0);
}

// void HAL_SD_MspDeInit(SD_HandleTypeDef *hsd) {
//     HAL_NVIC_DisableIRQ(SDMMC_IRQn);
//     SDMMC_CLK_DISABLE();
// }

bool sdcard_is_present(void) {
    if(!mp_hal_pin_read(MICROPY_HW_SDCARD_DETECT_PIN)) {
        Stat &= ~STA_NODISK;
        return true;
    } else {
        Stat |= STA_NODISK;
        return false; 
    }
}

bool sdcard_power_on(void) {
    if (!sdcard_is_present()) {
        return false;
    }
    sd_power_on();
    // TODO
    // if (sdc) {
    //     sdcard_power_off();
    //     goto error;
    // }

    return true;

// error:

//     return false;
}

void sdcard_power_off(void) {
    sd_power_off();
}

void sdcard_read_csd(uint8_t *data) {
    sd_spi_send_cmd(CMD9, 0);
    sd_spi_receive_block(data, 16);
}

uint64_t sdcard_get_capacity_in_bytes(void) {
    uint32_t size, count;
    sd_disk_ioctl(0, GET_SECTOR_SIZE, &size);
    sd_disk_ioctl(0, GET_SECTOR_COUNT, &count);
    return (uint64_t)size * (uint64_t)count;
}


void SD_IRQHandler(void) {
    IRQ_ENTER(INT_SSI2);
    // HAL_SD_IRQHandler(&sd_handle);
    IRQ_EXIT(INT_SSI2);
}


STATIC int sdcard_wait_finished(uint32_t timeout) {
    // Wait for HAL driver to be ready (eg for DMA to finish)
    uint32_t start = HAL_GetTick();
    for (;;) {
        // Do an atomic check of the state; WFI will exit even if IRQs are disabled
        uint32_t irq_state = disable_irq();
        if (!MAP_SSIBusy(SDC_GPIO_PORT_BASE)) {
            enable_irq(irq_state);
            break;
        }
        __WFI();
        enable_irq(irq_state);
        if (HAL_GetTick() - start >= timeout) {
            return MP_ETIMEDOUT;
        }
    }

    // Wait for SD card to complete the operation
    // for (;;) {
    //     HAL_SD_CardStateTypedef state = HAL_SD_GetCardState(sd);
    //     if (state == HAL_SD_CARD_TRANSFER) {
    //         return HAL_OK;
    //     }
    //     if (!(state == HAL_SD_CARD_SENDING || state == HAL_SD_CARD_RECEIVING || state == HAL_SD_CARD_PROGRAMMING)) {
    //         return HAL_ERROR;
    //     }
    //     if (HAL_GetTick() - start >= timeout) {
    //         return HAL_TIMEOUT;
    //     }
    //     __WFI();
    // }
    return RES_OK;
}

mp_uint_t sdcard_read_blocks(uint8_t *dest, uint32_t block_num, uint32_t num_blocks) {
    // check that SD card is initialised
    // if (sd_handle.Instance == NULL) {
    //     return HAL_ERROR;
    // }

    DRESULT err = RES_OK;

    // check that dest pointer is aligned on a 4-byte boundary
    uint8_t *orig_dest = NULL;
    uint32_t saved_word;
    if (((uint32_t)dest & 3) != 0) {
        // Pointer is not aligned so it needs fixing.
        // We could allocate a temporary block of RAM (as sdcard_write_blocks
        // does) but instead we are going to use the dest buffer inplace.  We
        // are going to align the pointer, save the initial word at the aligned
        // location, read into the aligned memory, move the memory back to the
        // unaligned location, then restore the initial bytes at the aligned
        // location.  We should have no trouble doing this as those initial
        // bytes at the aligned location should be able to be changed for the
        // duration of this function call.
        orig_dest = dest;
        dest = (uint8_t*)((uint32_t)dest & ~3);
        saved_word = *(uint32_t*)dest;
    }
#if MICROPY_HW_DMA
    if (query_irq() == IRQ_STATE_ENABLED) {
        // we must disable USB irqs to prevent MSC contention with SD card
        uint32_t basepri = raise_irq_pri(IRQ_PRI_OTG_FS);

        #if SDIO_USE_GPDMA
        dma_init(&sd_rx_dma, &SDMMC_RX_DMA, &sd_handle);
        sd_handle.hdmarx = &sd_rx_dma;
        #endif

        // make sure cache is flushed and invalidated so when DMA updates the RAM
        // from reading the peripheral the CPU then reads the new data
        // TODO
        // MP_HAL_CLEANINVALIDATE_DCACHE(dest, num_blocks * SDCARD_BLOCK_SIZE);

        err = sd_disk_read_dma(0, dest, block_num, num_blocks);
        if (err == RES_OK) {
            err = sdcard_wait_finished(60000);
        }

        #if SDIO_USE_GPDMA
        dma_deinit(&SDMMC_RX_DMA);
        sd_handle.hdmarx = NULL;
        #endif

        restore_irq_pri(basepri);
    } else {
#endif
        err = sd_disk_read(0, dest, block_num, num_blocks);
        if (err == RES_OK) {
            err = sdcard_wait_finished(60000);
        }
#if MICROPY_HW_DMA
    }
#endif

    if (orig_dest != NULL) {
        // move the read data to the non-aligned position, and restore the initial bytes
        memmove(orig_dest, dest, num_blocks * SDCARD_BLOCK_SIZE);
        memcpy(dest, &saved_word, orig_dest - dest);
    }

